// 15. Дано число. проверить кратно ли оно 7 и 23.
// 16. Дано число, обозначающее день недели. Выяснить является номер дня недели выходным.
// 17. По двум заданным числам проверять является ли одно квадратом другого.
// 18. Проверить истинность утверждения ¬(X ˅ Y)= ¬X ˄ ¬Y
// 19. Определить номер четверти и плоскости, в которой находится точка с координатами Х и У, причем Х ≠ 0 и У ≠ 0
// 20. Задать номер четверти, показать диапазоны для возможных координат.
// 21. Программа проверяет пятизначное число на палиндромом.
// 22. Найти расстояние между точками в пространстве 2D/3D
