// 41. Выяснить являются ли три числа сторонами треугольника 
//Если сумма любых двух чисел (из трех заданных) больше третьего, то они могут быть длинами сторон треугольника.
// CT = (a+b-c)*(b+c-a)*(c+a-b)/(a*b*c)
// CT = 1. Такое качество имеют лишь равносторонние треугольники. 
// CT<0,5. Это треугольники низкого качества, один угол у них является тупым, что говорит о некоторой доле «приплюснутости» таких фигур. 
// CT => 0. Абсолютно вырожденный треугольник.

string Triangle(int a, int b, int c)
{
    string result = string.Empty;
    int ct = 0;
    if (a + b > c || b + c > a || a + c > b)
    {
        ct = (a + b - c) * (b + c - a) * (c + a - b) / (a * b * c);
        result = "Числа являются сторонами треугольника. Качество треугольника = " + ct;
    }


    return result;
}

Console.WriteLine(Triangle(10, 10, 10));

// 42. Определить сколько чисел больше 0 введено с клавиатуры



// 43. Написать программу преобразования десятичного числа в двоичное

string NumerDez(int num)
{
    string result = string.Empty;
    result = Convert.ToString(num, 2).PadLeft(8, '0');
    return result;
}

Console.WriteLine(NumerDez(248));

// 44. Найти точку пересечения двух прямых заданных уравнением y = k1 * x + b1, y = k2 * x + b2, b1 k1 и b2 и k2 заданы



// 45. Показать числа Фибоначчи



// 46. Написать программу масштабирования фигуры



// 47. Написать программу копирования массива